[
  {
    "query": "¿Cómo elegir el smartphone adecuado para mis necesidades?",
    "positive": "Elegir smartphone: 1. Presupuesto: gama baja (<300€), media (300-600€), alta (>600€). 2. Uso principal: gaming (Snapdragon 8 Gen 2, RAM 12GB+), fotografía (triple cámara 50MP+, OIS), productividad (pantalla 120Hz, 5G, batería 5000mAh+). 3. Sistema operativo: Android (más opciones, personalizable), iOS (más estable, actualizaciones largas). 4. Tamaño pantalla: 6.1-6.4\" compacto, 6.5-6.7\" estándar, >6.7\" phablet. 5. Almacenamiento: mínimo 128GB, considerar expansión microSD. 6. Batería: >4000mAh para un día completo. 7. Cámaras: principal 48MP+, ultra gran angular, macro, profundidad. 8. Conectividad: 5G, WiFi 6, NFC, Bluetooth 5.2+. 9. Reseñas: verificar CNET, GSMArena, usuarios reales. 10. Garantía: 2 años oficiales, cobertura accidental opcional.",
    "negatives": [
      "El precio es el único factor importante al elegir un smartphone.",
      "Todos los smartphones Android son iguales en rendimiento y características.",
      "Los smartphones chinos no son confiables para uso diario."
    ]
  },
  {
    "query": "¿Qué características buscar en una laptop para desarrollo de software?",
    "positive": "Laptop desarrollo software: 1. Procesador: Intel Core i5/i7 (12ª-13ª gen) o AMD Ryzen 5/7 (7000 series), mínimo 8 núcleos. 2. RAM: 16GB mínimo, 32GB recomendado, DDR4/DDR5. 3. Almacenamiento: SSD NVMe 512GB+, posibilidad expansión. 4. Pantalla: 15.6\" FHD IPS, 120Hz opcional, buena calibración color. 5. Gráficos: integrados suficientes para desarrollo, dedicados si machine learning. 6. Puertos: USB-C (Thunderbolt), USB-A, HDMI, lector tarjetas, audio jack. 7. Teclado: mecánico o membrana buena, retroiluminación, layout cómodo. 8. Batería: 6-8 horas uso normal. 9. Sistema operativo: Windows 11, Ubuntu, macOS según preferencia. 10. Peso: <2kg para portabilidad. 11. Refrigeración: buena disipación calor para compilaciones largas. 12. Precio: 800-1500€ dependiendo especificaciones.",
    "negatives": [
      "Para desarrollo de software solo necesitas un procesador básico y 4GB RAM.",
      "Las laptops con Windows no son adecuadas para desarrollo profesional.",
      "El tamaño de pantalla no importa para programar."
    ]
  },
  {
    "query": "¿Cómo elegir los mejores auriculares inalámbricos?",
    "positive": "Auriculares inalámbricos: 1. Tipo: intrauditivos (portabilidad, cancelación ruido), suprauditivos (comodidad largas sesiones), cuello (batería extra). 2. Códecs: SBC básico, AAC para Apple, aptX/aptX HD para Android, LDAC para alta resolución. 3. Cancelación ruido activa (ANC): feedforward + feedback, transparencia mode. 4. Batería: >6 horas reproducción, >20 horas con case, carga rápida (15min = 1hora). 5. Conectividad: Bluetooth 5.2+, multipoint (conectar 2 dispositivos), latencia baja gaming. 6. Calidad sonido: drivers dinámicos/baquío, respuesta frecuencia amplia. 7. Micrófonos: beamforming, reducción ruido, llamadas claras. 8. Controles táctiles: intuitivos, personalizables. 9. Resistencia: IPX4 mínimo, mejor IPX7. 10. Compatibilidad: Android/iOS, app companion. 11. Ergonomía: ajuste cómodo, peso ligero. 12. Precio: 50-200€ relación calidad-precio.",
    "negatives": [
      "Los auriculares inalámbricos tienen peor calidad de sonido que los cableados.",
      "La cancelación de ruido no es importante en auriculares económicos.",
      "Todos los auriculares Bluetooth tienen la misma calidad de conexión."
    ]
  },
  {
    "query": "¿Qué considerar al comprar una smart TV 4K?",
    "positive": "Smart TV 4K: 1. Tamaño: 43-50\" sala pequeña, 55-65\" sala mediana, 70+\" home cinema. 2. Panel: LED estándar, QLED (brillo, colores), OLED (contraste infinito, negro perfecto). 3. Resolución: UHD 4K (3840x2160), verificar escalado contenido HD. 4. HDR: HDR10, HDR10+, Dolby Vision para rango dinámico amplio. 5. Procesador: Crystal Processor 4K Samsung, X1 Sony, etc. para upscaling. 6. Sistema operativo: Tizen (Samsung), webOS (LG), Android TV (Sony), Roku TV. 7. Smart features: app store amplio, voice control, casting, gaming. 8. Conectividad: HDMI 2.1 (4K@120Hz, ALLM), WiFi 6, Bluetooth 5.0. 9. Sonido: Dolby Atmos, DTS:X, subwoofer inalámbrico. 10. Gaming: HDMI 2.1, VRR, input lag <20ms. 11. Garantía: 2-3 años, cobertura pixels quemados. 12. Precio: 400-800€ según tamaño/tecnología.",
    "negatives": [
      "Todas las TVs 4K tienen la misma calidad de imagen sin importar el precio.",
      "Las smart TVs no necesitan HDMI 2.1 para contenido 4K.",
      "El sistema operativo de la smart TV no afecta la experiencia de uso."
    ]
  },
  {
    "query": "¿Cómo elegir la mejor tarjeta gráfica para gaming?",
    "positive": "Tarjeta gráfica gaming: 1. Presupuesto: GTX 1660/RTX 4060 (200-300€), RTX 4070 (400-500€), RTX 4080/RTX 4090 (600-1000€+). 2. Resolución objetivo: 1080p (GTX 1660 suficiente), 1440p (RTX 3060+), 4K (RTX 3080+). 3. Rendimiento: buscar benchmarks en juegos específicos, ray tracing con DLSS. 4. Memoria VRAM: 6GB mínimo 1080p, 8GB+ 1440p, 12GB+ 4K. 5. Refrigeración: cooler personalizado, temperaturas <80°C under load. 6. Consumo energía: verificar PSU requirements (600-850W). 7. Puertos: HDMI 2.1, DisplayPort 1.4+. 8. Overclocking: potencial si unlocked. 9. Compatibilidad: verificar slot PCIe, tamaño case. 10. Ruido: <40dB idle, <50dB load. 11. Bundle: incluye juegos, cables, software. 12. Futuro: tecnología actualizable (DLSS,FSR), soporte AV1 encoding.",
    "negatives": [
      "Cualquier tarjeta gráfica GTX 1050 es suficiente para gaming moderno.",
      "Las tarjetas gráficas AMD no son buenas para gaming.",
      "La memoria VRAM no es importante para juegos actuales."
    ]
  },
  {
    "query": "¿Qué router WiFi elegir para casa inteligente?",
    "positive": "Router WiFi casa inteligente: 1. Estándar WiFi: WiFi 6 (AX) para múltiples dispositivos, velocidad 1-6Gbps. 2. Cobertura: mesh system (Google Nest, Eero, Amazon Eero) para casas grandes, beamforming para dirección señal. 3. Puertos: Gigabit Ethernet (4-8 puertos), WAN 2.5Gbps+, USB 3.0. 4. Seguridad: WPA3, VPN server integrado, parental controls. 5. Gestión: app móvil intuitiva, control voz Alexa/Google. 6. Velocidad internet: matching ISP speed (500-1000Mbps). 7. QoS: priorización gaming/streaming. 8. Dispositivos conectados: soporte 100+ dispositivos simultáneos. 9. Características smart: integración IFTTT, schedules, guest networks. 10. Procesador: multi-core para VPN/gaming. 11. Precio: 100-300€ single, 200-500€ mesh 2-pack. 12. Marcas: Asus RT-AX88U, Netgear Nighthawk, TP-Link Archer AX73.",
    "negatives": [
      "Cualquier router antiguo funciona bien con dispositivos inteligentes.",
      "Los routers mesh son innecesarios para casas pequeñas.",
      "La seguridad WiFi no es importante para redes domésticas."
    ]
  },
  {
    "query": "¿Cómo elegir el mejor monitor gaming?",
    "positive": "Monitor gaming: 1. Tamaño: 24-27\" desktop, 32\"+ ultrawide para inmersión. 2. Resolución: 1080p entry-level, 1440p sweet spot, 4K para high-end. 3. Tasa refresco: 60Hz básico, 144Hz competitive gaming, 240Hz+ esports. 4. Tiempo respuesta: <1ms GtG, overdrive para reducir ghosting. 5. Panel: IPS (colores precisos, ángulos amplios), TN (respuesta rápida, barato), VA (contraste alto). 6. HDR: HDR400 mínimo, mejor HDR1000+. 7. Conectividad: HDMI 2.1, DisplayPort 1.4, USB hub. 8. Ergonomía: ajuste altura/inclinación, VESA mount. 9. Sincronización: G-Sync (NVIDIA), FreeSync (AMD), compatible ambas. 10. Curvatura: 1500R-1800R para inmersión. 11. Brillo/contraste: 300-400 nits, 1000:1+ contraste. 12. Precio: 150-300€ 1440p 144Hz, 300-500€ high-end.",
    "negatives": [
      "Los monitores de 60Hz son suficientes para cualquier tipo de gaming.",
      "Los monitores IPS son más lentos que los TN para gaming.",
      "La resolución 4K es necesaria para gaming competitivo."
    ]
  },
  {
    "query": "¿Qué características buscar en una consola de juegos?",
    "positive": "Consola gaming: 1. Generación: PS5/Series X high-end, PS4 Pro/Series S mid-range, Nintendo Switch híbrida. 2. Exclusivos: PS5 (Spider-Man, God of War), Xbox (Halo, Forza), Nintendo (Mario, Zelda). 3. Rendimiento: ray tracing, 4K 60FPS, carga rápida SSD. 4. Almacenamiento: 825GB-1TB base, expansión M.2 SSD. 5. Retrocompatibilidad: PS5 juega PS4/Xbox Series X juega Xbox One. 6. Multijugador: online gratuito, cross-play, Game Pass (Xbox). 7. Media: Blu-ray 4K, streaming apps, remote play. 8. Controles: DualSense haptics/adaptative triggers, Xbox controller premium. 9. Ecosistema: PS Plus/Xbox Game Pass, retro gaming. 10. Precio: PS5 499€, Xbox Series S 299€, Nintendo Switch 299€. 11. Accesorios: VR (PS VR2), portable gaming. 12. Comunidad: mods, speedrunning, esports.",
    "negatives": [
      "Todas las consolas modernas tienen el mismo rendimiento gráfico.",
      "Los juegos exclusivos no son importantes al elegir consola.",
      "El almacenamiento interno es suficiente para la mayoría de usuarios."
    ]
  }
]
