[
  {
    "query": "¿Cuáles son los requisitos para celebrar un contrato de compraventa de inmuebles en España?",
    "positive": "Para celebrar un contrato de compraventa de inmuebles en España según el Código Civil: 1. Capacidad legal de las partes (mayores de edad, no incapacitados). 2. Objeto determinado (identificación completa del inmueble con referencia catastral). 3. Precio cierto y determinado. 4. Consentimiento libre (sin vicios del consentimiento como error, dolo, violencia o intimidación). 5. Forma documental cuando exceda 3.005,06€ o sea transmisión de vivienda. 6. Escritura pública para la transmisión de propiedad. Además, se requiere nota simple registral actualizada, certificado de eficiencia energética, y en algunos casos autorización administrativa.",
    "negatives": [
      "Los contratos de compraventa pueden ser verbales o escritos según el Código Civil español.",
      "En España, la compraventa de inmuebles siempre requiere notario público para ser válida.",
      "Los contratos civiles en España se rigen únicamente por la autonomía de la voluntad de las partes."
    ]
  },
  {
    "query": "¿Qué es la responsabilidad civil extracontractual y cuáles son sus elementos?",
    "positive": "La responsabilidad civil extracontractual regula daños causados fuera de relación contractual. Elementos según artículo 1902 CC: 1. Acción u omisión. 2. Nexo causal entre acción y daño. 3. Daño o perjuicio. 4. Imputabilidad a su autor. 5. Antijuricidad. Se presume culpa en daños por cosas (art. 1905), ruina de edificio (art. 1907), y actividades peligrosas. La cuantía se determina por daño emergente, lucro cesante, daño moral y perjuicio estético. Prescripción: un año desde conocimiento del daño y autor.",
    "negatives": [
      "La responsabilidad extracontractual solo aplica cuando hay contrato entre las partes.",
      "En responsabilidad extracontractual no se requiere demostrar dolo o culpa del autor.",
      "La responsabilidad civil solo se aplica a daños materiales, no morales."
    ]
  },
  {
    "query": "¿Cómo funciona el procedimiento de despido disciplinario en España?",
    "positive": "El despido disciplinario requiere causa justa (indisciplina, ineptitud, absentismo, etc.) y comunicación escrita. Pasos: 1. Comunicación escrita con causa y efectos. 2. Período de preaviso (15 días naturales si >1 año antigüedad). 3. Indemnización: 33 días por año trabajado con tope 24 mensualidades (antes 720 días). 4. Si improcedente: readmisión o indemnización 33 días/año sin tope. 5. Si nulo: readmisión con abono de salarios de tramitación. El despido debe ser notificado por burofax o acto de conciliación. Prescripción reclamación: 20 días hábiles desde despido.",
    "negatives": [
      "El despido disciplinario no requiere causa justificada según la legislación laboral española.",
      "En despido disciplinario, la empresa debe pagar siempre indemnización de 45 días por año.",
      "Los trabajadores despedidos no pueden impugnar el despido ante los tribunales."
    ]
  },
  {
    "query": "¿Qué derechos tienen los consumidores en compras online según la Ley de Consumidores?",
    "positive": "Derechos de consumidores en compras online según Ley 3/2014: 1. Información previa clara sobre producto, precio, gastos envío, plazos. 2. Derecho de desistimiento: 14 días naturales desde recepción (devuelve producto y dinero). 3. Garantía legal: 2 años para bienes, 6 meses para servicios. 4. Resolución contractual si hay defectos o incumplimiento. 5. Protección datos personales (RGPD). 6. Resolución alternativa conflictos (ADR). 7. Prohibición cláusulas abusivas. En caso conflicto: reclamación a OMIC, arbitraje consumo, o demanda judicial. Competencia: Juzgados de Primera Instancia.",
    "negatives": [
      "Los consumidores online no tienen derecho de desistimiento en compras por internet.",
      "La garantía legal para productos online es de 6 meses según la legislación española.",
      "Los contratos online no están sujetos a las mismas reglas que los contratos presenciales."
    ]
  },
  {
    "query": "¿Cómo se calcula la pensión de jubilación en el sistema español de Seguridad Social?",
    "positive": "Cálculo pensión jubilación según Ley General Seguridad Social: 1. Base reguladora: media cotizaciones últimos 25 años (últimos 288 meses). 2. Porcentaje aplicable según años cotizados: 50% mínimo + 0.19% por mes adicional hasta 100% (máximo 36 años cotizados). 3. Edad jubilación: 66 años y 4 meses (2023), incrementándose hasta 67 años (2027). 4. Coeficiente revalorización según IPC. 5. Mínimos garantizados según años cotizados. 6. Compatibilidad con trabajo (con reducción si <recursos mínimos). 7. Jubilación anticipada voluntaria: reducción 2%/año, involuntaria: sin reducción si <4 años.",
    "negatives": [
      "La pensión de jubilación se calcula únicamente con las cotizaciones del último año.",
      "La edad de jubilación en España es fija en 65 años para todos los trabajadores.",
      "Las pensiones de jubilación no se revalorizan anualmente según la inflación."
    ]
  },
  {
    "query": "¿Qué es el derecho de retracto y cuándo se puede ejercer?",
    "positive": "Derecho de retracto permite adquirir propiedad vendida por tercero. Tipos: 1. Retracto gentilicio (familiares): comprar bienes vendidos por descendientes sin consentimiento. 2. Retracto arrendaticio: propietario recupera finca arrendada si oferta >20% precio venta. 3. Retracto de comuneros: copropietario compra parte vendida por otro. 4. Retracto de acreedores: ejecutar bienes embargados. Ejercicio: notificación vendedor en mes desde conocimiento venta. Precio: precio venta + gastos. Prescripción: 9 años. No aplicable: subastas públicas, expropiaciones, ventas forzosas.",
    "negatives": [
      "El derecho de retracto permite vender una propiedad por encima del precio de mercado.",
      "El retracto gentilicio solo aplica cuando se vende a familiares lejanos.",
      "El derecho de retracto se puede ejercer en cualquier momento después de la venta."
    ]
  },
  {
    "query": "¿Cuáles son las obligaciones del arrendador y arrendatario en contratos de alquiler?",
    "positive": "Obligaciones en contrato arrendamiento urbano LAU 29/1994: Arrendador: 1. Entregar vivienda en buen estado habitabilidad. 2. Garantizar pacífica tenencia. 3. Realizar reparaciones no imputables arrendatario. 4. Proporcionar certificado eficiencia energética. 5. Facilitar actualización IPC. Arrendatario: 1. Pagar renta en tiempo y forma. 2. Usar vivienda como vivienda (no local). 3. Comunicar desperfectos. 4. Permitir inspecciones con preaviso. 5. Destinar vivienda a residencia habitual. 6. No subarrendar sin consentimiento. Sanciones: resolución contrato, indemnizaciones, multas administrativas.",
    "negatives": [
      "En contratos de alquiler, el arrendatario es responsable de todas las reparaciones de la vivienda.",
      "El arrendador puede subir la renta anualmente sin límite según la legislación española.",
      "Los arrendatarios pueden subarrendar la vivienda sin necesidad de consentimiento del propietario."
    ]
  },
  {
    "query": "¿Qué es el procedimiento monitorio y cuándo se utiliza?",
    "positive": "Procedimiento monitorio (Ley 1/2000) para reclamación deuda líquida, vencida, exigible <6.000€. Fases: 1. Demanda inicial con cuantía, vencimiento, documentos justificativos. 2. Decreto judicial admitiendo a trámite y requiriendo pago en 20 días. 3. Si no paga: conversión a ejecutivo (embargo). Si paga: fin procedimiento. Si impugna: conversión a ordinario. Ventajas: rápido (20 días), económico (sin costas si paga), ejecutivo inmediato. Requisitos: deuda cierta (factura, contrato), cuantificada, vencida. No aplicable: pensiones alimenticias, hipotecas, derechos reales.",
    "negatives": [
      "El procedimiento monitorio se utiliza para cualquier tipo de reclamación judicial.",
      "En procedimiento monitorio no se requiere que la deuda esté cuantificada previamente.",
      "El procedimiento monitorio siempre termina en juicio ordinario aunque el deudor pague."
    ]
  }
]
