[
  {
    "query": "¿Cuáles son los síntomas y tratamiento de la insuficiencia cardíaca congestiva?",
    "positive": "La insuficiencia cardíaca congestiva (ICC) presenta síntomas como disnea paroxística nocturna, ortopnea, edema periférico, fatiga, taquicardia, y oliguria. Diagnóstico mediante ecocardiograma, BNP/NT-proBNP elevados, radiografía tórax (cardiomegalia, líneas B de Kerley, derrame pleural). Tratamiento: 1. IECA/ARA-II (enalapril, losartán) + betabloqueantes (carvedilol, bisoprolol). 2. Antagonistas mineralocorticoides (espironolactona) si clase funcional II-IV. 3. Diuréticos del asa (furosemida) para congestión. 4. Sacubitril/valsartán si FEVI≤35%. 5. Ivabradina si FC>70 lpm. 6. Control factores riesgo: dieta hiposódica, ejercicio, abandono tabaquismo. 7. Trasplante cardíaco si refractaria. Pronóstico depende de clase NYHA y FEVI.",
    "negatives": [
      "La insuficiencia cardíaca se trata únicamente con reposo absoluto y dieta blanda.",
      "Los síntomas de insuficiencia cardíaca aparecen solo en etapas terminales.",
      "La insuficiencia cardíaca congestiva no requiere seguimiento cardiológico especializado."
    ]
  },
  {
    "query": "¿Cómo se diagnostica y trata la diabetes mellitus tipo 2?",
    "positive": "Diagnóstico DM2 según ADA: HbA1c≥6.5%, glucemia basal≥126 mg/dl, o glucemia casual≥200 mg/dl con síntomas. Pruebas confirmatorias: test tolerancia oral glucosa, péptido C, anticuerpos GAD. Tratamiento integral: 1. Metformina como primera línea (500mg/12h, aumentar gradualmente). 2. Si no controla: añadir SGLT2i (empagliflozina), DPP-4i (sitagliptina), o GLP-1 (liraglutida). 3. Insulina si HbA1c>9% o cetosis. 4. Control factores cardiovascular: estatinas, antihipertensivos. 5. Educación diabetológica: autocontrol glucémico, dieta mediterránea, ejercicio 150min/semana. 6. Seguimiento: HbA1c cada 3-6 meses, fondo ojo, microalbuminuria, podología. Objetivos: HbA1c<7%, PA<130/80, LDL<70 mg/dl.",
    "negatives": [
      "La diabetes tipo 2 se diagnostica únicamente con medición de glucosa en sangre capilar.",
      "El tratamiento de diabetes tipo 2 requiere siempre insulina desde el diagnóstico.",
      "La diabetes tipo 2 no requiere control de factores de riesgo cardiovascular."
    ]
  },
  {
    "query": "¿Cuáles son las manifestaciones clínicas y manejo del asma bronquial?",
    "positive": "Asma bronquial: sibilancias, disnea, tos nocturna, variabilidad PEF>20%. Clasificación GEMA: controlado, parcialmente controlado, no controlado. Tratamiento escalonado: Escalón 1 (leve intermitente): SABA a demanda. Escalón 2: corticoides inhalados (budesonida 200-400mcg/12h). Escalón 3: añadir LABA (formoterol). Escalón 4: tiotropio o teofilina. Escalón 5: omalizumab/omalizumab. Educación: técnica inhalatoria correcta, plan acción escrito, evitación desencadenantes (alérgenos, humo tabaco, infecciones). Seguimiento: espirometría, FeNO, cuestionario control. Crisis asmática: salbutamol nebulizado + oxígeno, ipratropio, corticoides sistémicos, magnesio IV si refractaria.",
    "negatives": [
      "El asma bronquial se trata únicamente con antibióticos en caso de infección.",
      "Los corticoides inhalados no son seguros para uso prolongado en asma.",
      "El asma bronquial no requiere seguimiento espirométrico regular."
    ]
  },
  {
    "query": "¿Cómo se evalúa y trata la hipertensión arterial esencial?",
    "positive": "Hipertensión esencial: PA≥140/90 mmHg en ≥2 consultas. Evaluación: historia familiar, exploración cardiovascular, analítica (glucosa, lípidos, creatinina, iones, microalbuminuria), ECG, ecocardiograma si sospecha órgano diana. Clasificación: Grado 1: 140-159/90-99, Grado 2: 160-179/100-109, Grado 3: ≥180/110. Tratamiento: cambio estilo vida (dieta DASH, reducción sal <5g/día, ejercicio, pérdida peso). Farmacológico si PA≥140/90: 1ª línea: IECA/ARA-II (irbesartán 150-300mg/día), amlodipino (5-10mg/día), o hidroclorotiazida (12.5-25mg/día). Combinaciones: IECA+diurético, ARA-II+calcioantagonista. Objetivos: <140/90 general, <130/80 si diabetes/enfermedad renal/cardiovascular. Seguimiento mensual hasta control, luego trimestral.",
    "negatives": [
      "La hipertensión arterial se trata únicamente con dieta baja en sal.",
      "Los antihipertensivos deben suspenderse si la presión se normaliza.",
      "La hipertensión arterial no requiere evaluación de daño orgánico."
    ]
  },
  {
    "query": "¿Cuáles son los criterios diagnósticos y tratamiento de la neumonía adquirida en comunidad?",
    "positive": "Neumonía adquirida en comunidad (NAC): fiebre, tos productiva, disnea, dolor torácico pleurítico, crepitantes. Diagnóstico: radiografía tórax (infiltrado alveolar), leucocitosis con desviación izquierda, procalcitonina elevada. Escala CRB-65 para gravedad. Tratamiento empírico según antibiograma local: Leve-moderada (ambulatorio): amoxicilina-ácido clavulánico 875/125mg/8h 7-10 días. Grave (ingreso): ceftriaxona 1g/12h IV + azitromicina 500mg/día IV/VO. Ajustar según evolución clínica y cultivos (esputo, hemocultivos, antígenos urinarios neumococo/legionella). Complicaciones: derrame pleural (toracocentesis), empiema, sepsis. Profilaxis: vacunación antineumocócica (>65 años, riesgo), antigripal anual. Seguimiento: radiografía control 4-6 semanas.",
    "negatives": [
      "La neumonía adquirida en comunidad siempre requiere ingreso hospitalario.",
      "Los antibióticos para neumonía se administran por tiempo indefinido hasta curación completa.",
      "La neumonía no requiere evaluación radiológica para el diagnóstico."
    ]
  },
  {
    "query": "¿Cómo se maneja la fibrilación auricular en paciente estable?",
    "positive": "Fibrilación auricular (FA): ritmo irregular, pulsos deficitarios, riesgo tromboembólico (CHA2DS2-VASc). Evaluación: ECG 12 derivaciones, ecocardiograma, analítica tiroides. Estratificación riesgo: CHADS2/CHA2DS2-VASc para anticoagulación, HAS-BLED para hemorragia. Control ritmo vs frecuencia: Ritmo si sintomática, jóvenes, primera detección, insuficiencia cardíaca. Frecuencia si >65 años, enfermedad coronaria, contraindicaciones antiarrítmicos. Anticoagulación: dabigatrán 110-150mg/12h, rivaroxabán 20mg/día, apixabán 5mg/12h, edoxabán 30-60mg/día. Control frecuencia: betabloqueantes (bisoprolol 2.5-10mg/día), digoxina 0.125-0.25mg/día. Cardioversión si inestable. Ablación por radiofrecuencia si refractaria.",
    "negatives": [
      "La fibrilación auricular no requiere anticoagulación si no hay síntomas.",
      "El control del ritmo es siempre preferible al control de la frecuencia en FA.",
      "La fibrilación auricular no aumenta el riesgo de eventos tromboembólicos."
    ]
  },
  {
    "query": "¿Cuáles son las indicaciones y manejo de la anticoagulación oral?",
    "positive": "Anticoagulación oral indicada en: FA (CHA2DS2-VASc≥1), trombosis venosa profunda, tromboembolismo pulmonar, prótesis valvulares mecánicas, trombofilia. Elección fármaco: DOAC preferidos vs warfarina (INR 2-3). Dabigatrán 110/150mg/12h (insuficiencia renal CrCl<30 contraindicación). Rivaroxabán 15-20mg/día. Apixabán 2.5-5mg/12h. Edoxabán 30-60mg/día. Monitoreo: función renal basal y anual, hemograma, hepatograma. Interacciones: rifampicina, carbamazepina, amiodarona, claritromicina. Reversión: idarucizumab (dabigatrán), andexanet (factores Xa), vitamina K+complejo protrombínico (warfarina). Profilaxis sangrado: evaluación HAS-BLED. Pacientes: educación autocontrol, dieta estable vitamina K, evitar AINE/herbolarios.",
    "negatives": [
      "Los anticoagulantes orales requieren monitoreo diario del INR en todos los pacientes.",
      "Los nuevos anticoagulantes orales (DOAC) tienen menos interacciones que la warfarina.",
      "La anticoagulación oral está contraindicada en pacientes mayores de 80 años."
    ]
  },
  {
    "query": "¿Cómo se diagnostica y trata la depresión mayor?",
    "positive": "Depresión mayor DSM-5: ≥5 síntomas ≥2 semanas (ánimo deprimido, anhedonia, cambios peso/apetito, insomnio/hipersomnia, agitación/retardo, fatiga, sentimientos culpa/inutilidad, concentración alterada, ideación suicida). Diagnóstico diferencial: trastorno bipolar, depresión secundaria (hipotiroidismo, déficit B12, Parkinson). Tratamiento: 1ª línea antidepresivos ISRS (sertralina 50-200mg/día, escitalopram 10-20mg/día) 4-6 semanas onset. Si respuesta parcial: aumentar dosis o cambiar ISRS. Si refractaria: SNRI (venlafaxina 75-225mg/día), mirtazapina 15-45mg/día, bupropión 150-300mg/día. Psicoterapia: TCC, terapia interpersonal. Terapia combinada superior. Manejo crisis: hospitalización si riesgo suicida. Seguimiento: escala Hamilton/MADRS, efectos adversos (náuseas, insomnio, disfunción sexual).",
    "negatives": [
      "La depresión mayor se trata únicamente con psicoterapia sin medicación.",
      "Los antidepresivos ISRS tienen efecto inmediato desde la primera dosis.",
      "La depresión mayor no requiere evaluación médica para descartar causas orgánicas."
    ]
  }
]
