[
  {
    "query": "¿Cuáles son los síntomas de la insuficiencia cardíaca congestiva?",
    "positive": "La insuficiencia cardíaca congestiva presenta disnea paroxística nocturna, ortopnea, edema periférico, fatiga, taquicardia, y oliguria. Se diagnostica con ecocardiograma, BNP elevado, y radiografía de tórax mostrando cardiomegalia.",
    "negatives": [
      "La insuficiencia cardíaca solo aparece en pacientes mayores de 70 años.",
      "Los síntomas de insuficiencia cardíaca son siempre agudos e intensos.",
      "La insuficiencia cardíaca no requiere seguimiento cardiológico continuo."
    ]
  },
  {
    "query": "¿Cómo implementar autenticación JWT en una API REST?",
    "positive": "Para JWT en API REST: instala jsonwebtoken, crea middleware de verificación que valide token en header Authorization, genera tokens en login endpoint con payload y expiración, usa HS256 para firma, implementa refresh tokens para seguridad.",
    "negatives": [
      "JWT se implementa guardando tokens directamente en localStorage.",
      "Los tokens JWT no necesitan expiración ya que son inherentemente seguros.",
      "JWT no requiere HTTPS para funcionar correctamente."
    ]
  },
  {
    "query": "¿Qué es la responsabilidad civil extracontractual?",
    "positive": "Responsabilidad civil extracontractual regula daños causados fuera de relación contractual. Requiere acción u omisión, nexo causal, daño, imputabilidad, antijuricidad. Presunción de culpa en daños por cosas y ruina de edificio.",
    "negatives": [
      "La responsabilidad extracontractual solo aplica cuando hay contrato entre partes.",
      "En responsabilidad extracontractual no se requiere demostrar culpa del autor.",
      "La responsabilidad civil solo cubre daños materiales."
    ]
  },
  {
    "query": "¿Cómo elegir un smartphone para desarrollo móvil?",
    "positive": "Para desarrollo móvil: procesador Snapdragon 8+ o A15 Bionic, mínimo 8GB RAM, 256GB almacenamiento, pantalla 120Hz, batería 4500mAh+, 5G, puerto USB-C, sistema operativo actualizable. Considera compatibilidad con emuladores Android/iOS.",
    "negatives": [
      "Para desarrollo móvil solo necesitas un smartphone básico con Android.",
      "La RAM no es importante para desarrollo de aplicaciones móviles.",
      "Los smartphones chinos no son adecuados para desarrollo profesional."
    ]
  },
  {
    "query": "¿Cómo estudiar efectivamente para exámenes de programación?",
    "positive": "Estudio programación: práctica diaria con coding challenges (LeetCode, HackerRank), proyectos personales GitHub, explicar conceptos con Feynman technique, flashcards para algoritmos, debugging sessions, revisión código open source, pair programming.",
    "negatives": [
      "Para programar solo necesitas memorizar la sintaxis del lenguaje.",
      "Los proyectos personales no son necesarios para aprender programación.",
      "Solo es necesario leer documentación para convertirse en buen programador."
    ]
  },
  {
    "query": "¿Cuáles son los principios de la arquitectura de microservicios?",
    "positive": "Microservicios: descomposición por dominio bounded contexts, base datos por servicio, comunicación APIs REST/gRPC + mensajería, service discovery, API Gateway, configuración centralizada, observabilidad con logs métricas tracing.",
    "negatives": [
      "Los microservicios requieren que todos los servicios compartan la misma base de datos.",
      "La arquitectura de microservicios elimina la necesidad de coordinación entre equipos.",
      "Los microservicios no requieren estrategias especiales de monitoreo."
    ]
  },
  {
    "query": "¿Cómo funciona el derecho de desistimiento en compras online?",
    "positive": "Derecho de desistimiento compras online: 14 días naturales desde recepción producto, comunicar decisión por escrito, devolver producto sin daños, reembolso en 14 días. Excepciones: productos personalizados, perecederos, software abierto.",
    "negatives": [
      "El derecho de desistimiento solo aplica a productos defectuosos.",
      "Los consumidores pueden desistir en cualquier momento sin límite de tiempo.",
      "El derecho de desistimiento no incluye gastos de envío de devolución."
    ]
  },
  {
    "query": "¿Qué características buscar en una laptop para machine learning?",
    "positive": "Laptop ML: GPU dedicada NVIDIA (RTX 3060+ con CUDA), 32GB+ RAM DDR4, procesador Intel i7/AMD Ryzen 7, SSD NVMe 1TB+, pantalla 15.6\" 1080p, batería 4+ horas, puertos USB-C/HDMI, Linux preinstalado preferible.",
    "negatives": [
      "Para machine learning solo necesitas una laptop básica con Windows.",
      "La GPU integrada es suficiente para deep learning moderno.",
      "No necesitas más de 8GB RAM para machine learning."
    ]
  },
  {
    "query": "¿Cómo escribir un artículo científico en medicina?",
    "positive": "Artículo médico: estructura IMRAD, introducción con revisión literatura, métodos detallados para reproducibilidad, resultados con estadística, discusión interpretando hallazgos clínicos, referencias Vancouver, abstract estructurado, keywords MeSH.",
    "negatives": [
      "Los artículos médicos deben usar lenguaje técnico complejo para todos los lectores.",
      "La discusión debe contener todos los resultados experimentales nuevamente.",
      "Los artículos médicos no requieren estadística descriptiva detallada."
    ]
  },
  {
    "query": "¿Qué es la relatividad especial de Einstein?",
    "positive": "Relatividad especial: postulados constancia velocidad luz y equivalencia marcos inerciales. Consecuencias: dilatación tiempo, contracción longitud, equivalencia masa-energía E=mc². Espacio-tiempo Minkowski, transformaciones Lorentz.",
    "negatives": [
      "La relatividad especial significa que todo es relativo sin leyes físicas absolutas.",
      "La velocidad de la luz varía dependiendo del marco de referencia.",
      "La relatividad especial reemplaza completamente la física newtoniana."
    ]
  },
  {
    "query": "¿Cómo optimizar consultas SQL para big data?",
    "positive": "Optimización SQL big data: particionamiento tablas por fecha, índices apropiados (bitmap para columnas baja cardinalidad, B-tree para rangos), evitar SELECT *, usar LIMIT, joins eficientes, estadísticas actualizadas, query execution plans.",
    "negatives": [
      "En big data, las consultas SELECT * son igual de eficientes que consultas específicas.",
      "Los índices adicionales no son necesarios en sistemas de big data.",
      "La optimización de consultas SQL no es importante en big data."
    ]
  },
  {
    "query": "¿Cuáles son los derechos del consumidor en garantía de productos?",
    "positive": "Derechos consumidor garantía: 2 años desde entrega para bienes, 6 meses para servicios. Reparación, sustitución, rebaja precio, o resolución. Prueba de defecto para primeros 6 meses, consumidor demuestra defecto después.",
    "negatives": [
      "La garantía legal solo cubre productos defectuosos de fábrica.",
      "Los consumidores pueden elegir cualquier reparador para garantía.",
      "La garantía legal no tiene plazos específicos de duración."
    ]
  },
  {
    "query": "¿Cómo implementar cache distribuido con Redis?",
    "positive": "Redis distribuido: cluster para sharding automático, sentinels para failover, persistencia RDB+AOF, serialización JSON/MessagePack, estrategias cache-aside/write-through, TTL automático, monitoring con Redis CLI.",
    "negatives": [
      "Redis solo puede almacenar datos en formato string.",
      "Redis no soporta expiración automática de claves.",
      "Redis no puede escalar horizontalmente para grandes volúmenes."
    ]
  },
  {
    "query": "¿Qué es la diabetes mellitus tipo 2?",
    "positive": "DM2: trastorno metabólico caracterizado por hiperglucemia crónica debido resistencia insulina e insuficiente secreción. Diagnóstico: HbA1c≥6.5%, glucemia basal≥126 mg/dl, síntomas + glucemia≥200 mg/dl. Tratamiento: metformina primera línea, luego combinación con otros hipoglucemiantes.",
    "negatives": [
      "La diabetes tipo 2 solo afecta a personas mayores de 50 años.",
      "La diabetes tipo 2 se trata únicamente con insulina desde el diagnóstico.",
      "La diabetes tipo 2 no requiere control de complicaciones cardiovasculares."
    ]
  },
  {
    "query": "¿Cómo diseñar APIs RESTful siguiendo mejores prácticas?",
    "positive": "APIs RESTful: recursos como sustantivos (/users), métodos HTTP apropiados, códigos estado semánticos, versioning en URL/header, filtering/sorting/pagination, HATEOAS, documentación OpenAPI, autenticación JWT/OAuth, rate limiting.",
    "negatives": [
      "Las APIs RESTful deben usar únicamente el método GET para todas las operaciones.",
      "Los códigos de estado HTTP son opcionales en APIs REST.",
      "Las APIs RESTful requieren anidamiento jerárquico de todos los recursos."
    ]
  },
  {
    "query": "¿Qué es el aprendizaje automático supervisado?",
    "positive": "Aprendizaje supervisado: algoritmos aprenden de datos etiquetados para predecir outputs. Tipos: clasificación (categorías discretas) y regresión (valores continuos). Ejemplos: regresión logística, SVM, random forest, redes neuronales.",
    "negatives": [
      "El aprendizaje supervisado solo funciona con datos numéricos.",
      "Los algoritmos supervisados siempre son superiores al juicio humano.",
      "El aprendizaje supervisado no requiere datos de entrenamiento etiquetados."
    ]
  },
  {
    "query": "¿Cómo funciona la pensión de jubilación en España?",
    "positive": "Pensión jubilación España: base reguladora media 25 años cotizados, porcentaje 50%+0.19%/mes adicional hasta 100%, edad 66 años 4 meses (2023) incrementándose a 67. Compatibilidad con trabajo con reducción si <ingresos mínimos.",
    "negatives": [
      "La pensión de jubilación se calcula solo con los últimos 5 años de cotización.",
      "La edad de jubilación en España es fija en 65 años para todos.",
      "Las pensiones de jubilación no se revalorizan anualmente."
    ]
  },
  {
    "query": "¿Qué características buscar en una smart TV?",
    "positive": "Smart TV: panel LED/QLED/OLED, resolución 4K, HDR10+/Dolby Vision, procesador potente para upscaling, sistema operativo Tizen/webOS/Android TV, conectividad HDMI 2.1, WiFi 6, sonido Dolby Atmos, gaming features como VRR/ALLM.",
    "negatives": [
      "Todas las TVs 4K tienen la misma calidad de imagen independientemente del precio.",
      "Las smart TVs no necesitan HDMI 2.1 para contenido 4K.",
      "El sistema operativo de la smart TV no afecta la experiencia de usuario."
    ]
  },
  {
    "query": "¿Cómo implementar CI/CD con GitHub Actions?",
    "positive": "GitHub Actions CI/CD: workflows YAML en .github/workflows/, jobs paralelos/secuenciales, matrix testing múltiples versiones, caching dependencies, secrets para credenciales, artifacts para builds, deployment automático a staging/production.",
    "negatives": [
      "GitHub Actions solo funciona con repositorios públicos de GitHub.",
      "Los workflows de GitHub Actions no pueden ejecutar comandos del sistema.",
      "GitHub Actions requiere que todos los jobs se ejecuten en paralelo."
    ]
  }
]
